Revit 2024 API
CustomFieldData.SetCustomFieldProperties Method
 Sets an instance of ICustomFieldProperties which represents the properties of this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public void SetCustomFieldProperties(
	ICustomFieldProperties customFieldProperties
)
Visual Basic
Public Sub SetCustomFieldProperties ( _
	customFieldProperties As ICustomFieldProperties _
)
Visual C++
public:
void SetCustomFieldProperties(
	ICustomFieldProperties^ customFieldProperties
)
Parameters
customFieldProperties
Type: Autodesk.Revit.DB.ICustomFieldProperties
 An instance of ICustomFieldProperties which represents the properties of this field.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input properties are not valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Can't set the properties to a CustomFieldData of a SchedulableField (which is not added to a schedule).
See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace